In [46]:
import pandas as pd

In [47]:
df = pd.read_csv("chicago.csv", dtype = {"Department": "category"} ).dropna(how ='all')
df.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32062 entries, 0 to 32061
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  category
 3   Employee Annual Salary  32062 non-null  object
dtypes: category(1), object(3)
memory usage: 1.0+ MB

In [49]:
# need to use .str for applying string methods to each entry in a column
df["Name"]=df["Name"].str.title()
df["Position Title"]=df["Position Title"].str.title()
df["Department"]=df["Department"].str.title()

In [50]:
df

,Name,Position Title,Department,Employee Annual Salary
0,"Aaron, Elvia J",Water Rate Taker,Water Mgmnt,$90744.00
1,"Aaron, Jeffery M",Police Officer,Police,$84450.00
2,"Aaron, Karina",Police Officer,Police,$84450.00
3,"Aaron, Kimberlei R",Chief Contract Expediter,General Services,$89880.00
4,"Abad Jr, Vicente M",Civil Engineer Iv,Water Mgmnt,$106836.00
...,...,...,...,...
32057,"Zygadlo, Michael J",Frm Of Machinists - Automotive,General Services,$99528.00
32058,"Zygowicz, Peter J",Police Officer,Police,$87384.00
32059,"Zymantas, Mark E",Police Officer,Police,$84450.00
32060,"Zyrkowski, Carlo E",Police Officer,Police,$87384.00
32061,"Zyskowski, Dariusz",Chief Data Base Analyst,Doit,$113664.00

In [51]:
df["Department"] =  df["Department"].str.replace("Mgmnt", "Management")

In [52]:
df["Employee Annual Salary"]=df["Employee Annual Salary"].str.replace("$", "").astype(float)

Filtering using string methods

In [53]:
mask = df["Position Title"].str.lower().str.contains("water")
# .str.startswith("water")
# .str.endswith("water")

Removing whitespace

In [54]:
#.str.lstrip
#.str.rstrip
#.str.strip
df["Name"]=df["Name"].str.strip()
df["Position Title"]=df["Position Title"].str.strip()
df["Department"]=df["Department"].str.strip()

In [55]:
df.index = df["Name"]
df.pop("Name")

Name
Aaron,  Elvia J            Aaron,  Elvia J
Aaron,  Jeffery M        Aaron,  Jeffery M
Aaron,  Karina              Aaron,  Karina
Aaron,  Kimberlei R    Aaron,  Kimberlei R
Abad Jr,  Vicente M    Abad Jr,  Vicente M
                              ...
Zygadlo,  Michael J    Zygadlo,  Michael J
Zygowicz,  Peter J      Zygowicz,  Peter J
Zymantas,  Mark E        Zymantas,  Mark E
Zyrkowski,  Carlo E    Zyrkowski,  Carlo E
Zyskowski,  Dariusz    Zyskowski,  Dariusz
Name: Name, Length: 32062, dtype: object

,Position Title,Department,Employee Annual Salary
Name,,,
"Aaron, Elvia J",Water Rate Taker,Water Management,90744.0
"Aaron, Jeffery M",Police Officer,Police,84450.0
"Aaron, Karina",Police Officer,Police,84450.0
"Aaron, Kimberlei R",Chief Contract Expediter,General Services,89880.0
"Abad Jr, Vicente M",Civil Engineer Iv,Water Management,106836.0
...,...,...,...
"Zygadlo, Michael J",Frm Of Machinists - Automotive,General Services,99528.0
"Zygowicz, Peter J",Police Officer,Police,87384.0
"Zymantas, Mark E",Police Officer,Police,84450.0
"Zyrkowski, Carlo E",Police Officer,Police,87384.0
"Zyskowski, Dariusz",Chief Data Base Analyst,Doit,113664.0

Splitting

In [ ]:
#df["Name"].str.split(",").str.get(0) would get the last names for each name